## Creating a Dataframe

In [1]:
import pandas as pd
import numpy as np

### Empty Dataframe

In [2]:
df=pd.DataFrame()  # D and F are capital
print(df)

Empty DataFrame
Columns: []
Index: []

### From Clipboard

In [3]:
df=pd.read_clipboard()

### From List

In [4]:
Name=['Sahil', 'Sonia', 'Sourav', 'Vishal']
Age=[20, 21, 19, 18]
print(pd.DataFrame(list(zip(Name,Age)))) # Note: If you don't pass columns,it takes col names as 0 1 by default
print()
print(pd.DataFrame(list(zip(Name,Age)),columns=['Name','Age']))

        0   1
0   Sahil  20
1   Sonia  21
2  Sourav  19
3  Vishal  18

     Name  Age
0   Sahil   20
1   Sonia   21
2  Sourav   19
3  Vishal   18

#### Custom indexes

In [5]:
df=pd.DataFrame(list(zip(Name,Age)))
df.index=['First','Second','Third','Fourth']
print(df)

             0   1
First    Sahil  20
Second   Sonia  21
Third   Sourav  19
Fourth  Vishal  18

### From Single Series

In [6]:
s1=pd.Series(['A','B','C','D'])
print(s1.to_frame()) #col header will be 0,1 by default
print()
print(s1.to_frame(name='Alphabets'))

   0
0  A
1  B
2  C
3  D

  Alphabets
0         A
1         B
2         C
3         D

### From Multiple series as columns of dataframe

In [7]:
s1=pd.Series(['A','B','C','D'])
s2=pd.Series([10,20,30,40])

s1.to_frame(name = 'Name').join(s2.to_frame(name='Age'))

  Name  Age
0    A   10
1    B   20
2    C   30
3    D   40

### From dictionary

In [8]:
df=pd.DataFrame({'Name':['Sahil', 'Sonia', 'Sourav', 'Vishal'],
        'Age':[20, 21, 19, 18]})
df

     Name  Age
0   Sahil   20
1   Sonia   21
2  Sourav   19
3  Vishal   18

#### Assigning indexes after declaring the series

In [9]:
new_indexes=['a','b','c','d']
df.index=new_indexes
df

     Name  Age
a   Sahil   20
b   Sonia   21
c  Sourav   19
d  Vishal   18

### From csv

In [10]:
df = pd.read_csv ('https://people.sc.fsu.edu/~jburkardt/data/csv/crash_catalonia.csv')

In [11]:
df

  Day of Week   "Number of Crashes"
0      Sunday                 13664
1      Monday                 17279
2     Tuesday                 17337
3   Wednesday                 17394
4    Thursday                 17954
5      Friday                 19147
6    Saturday                 15714

#### Import specific columns

In [12]:
pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/crash_catalonia.csv', usecols= ['Day of Week'])

  Day of Week
0      Sunday
1      Monday
2     Tuesday
3   Wednesday
4    Thursday
5      Friday
6    Saturday

#### Replacing nans

In [13]:
pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/crash_catalonia.csv', na_values=['NA','np.nan'])

  Day of Week   "Number of Crashes"
0      Sunday                 13664
1      Monday                 17279
2     Tuesday                 17337
3   Wednesday                 17394
4    Thursday                 17954
5      Friday                 19147
6    Saturday                 15714

#### Read only first n rows

In [14]:
pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/crash_catalonia.csv',nrows=3)

  Day of Week   "Number of Crashes"
0      Sunday                 13664
1      Monday                 17279
2     Tuesday                 17337